update readme with new diagram and title for section
